{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":32,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,6],"dtype":"float32"}},{"class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU1","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":8,"activation":"elu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true}}],"keras_version":"tfjs-layers 0.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./modelBH-4h.weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[6,32],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[16,8],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[8,3],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[3],"dtype":"float32"}]}]}